sergev/LiteBSD/sys/mips/pic32/machdep.c
    /* 184 - I2C5 Master Event
     * 185 - SPI6 Fault
     * 186 - SPI6 Receive Done
     * 187 - SPI6 Transfer Done */
    IPC(46) = PIC32_IPC_IP0(0) | PIC32_IPC_IP1(LSPI) | PIC32_IPC_IP2(LSPI) | PIC32_IPC_IP3(LSPI);

    /* 188 - UART6 Fault
     * 189 - UART6 Receive Done
     * 190 - UART6 Transfer Done
     * 191 - Reserved */
    IPC(47) = PIC32_IPC_IP0(LUART) | PIC32_IPC_IP1(LUART) | PIC32_IPC_IP2(LUART) | PIC32_IPC_IP3(0);

    /* Read processor ID register. */
    cpu.cpuprid = mfc0_PRId();
}

void
initcpu()
{
    /* disable clock interrupts (until startrtclock()) */
#if 0
    // TODO: pic32
    register volatile struct chiptime *c = Mach_clock_addr;
    c->regb = REGB_DATA_MODE | REGB_HOURS_FORMAT;
    (void) c->regc;
#endif
    spl0();         /* safe to turn interrupts on now */
}

static void identify_cpu()
{
    unsigned osccon = OSCCON, spllcon = SPLLCON;
    unsigned pllmult = (spllcon >> 16 & 127) + 1;
    unsigned pllidiv = (spllcon >> 8 & 7) + 1;
    unsigned pllodiv = "\2\2\4\10\20\40\40\40"[spllcon >> 24 & 7];
    static const char *poscmod[] = { "external clock", "(reserved)",
                                     "crystal", "(disabled)" };

    printf ("cpu: PIC32MZ%s rev A%u, %u MHz\n",
        cpu_model, DEVID >> 28, CPU_KHZ/1000);

    /* COSC: current oscillator selection bits */
    printf ("oscillator: ");
    switch (osccon >> 12 & 7) {
    case 0:
    case 7:
        printf ("internal Fast RC, divided\n");
        break;
    case 1:
        printf ("system PLL div 1:%d mult x%d\n",
                pllidiv * pllodiv, pllmult);
        break;
    case 2:
        printf ("%s\n", poscmod [DEVCFG1 >> 8 & 3]);
        break;
    case 3:
        printf ("reserved\n");
        break;
    case 4:
        printf ("secondary\n");
        break;
    case 5:
        printf ("internal Low-Power RC\n");
        break;
    case 6:
        printf ("back-up Fast RC\n");
        break;
    }

    /*
     * Compute cache sizes.
     */
    unsigned config1 = mfc0_Config1();
    unsigned il = config1 >> 19 & 7;
    unsigned dl = config1 >> 10 & 7;

    machInstCacheSize = 0;
    machDataCacheSize = 0;
    if (il > 0) {
        unsigned is = config1 >> 22 & 7;
        unsigned ia = config1 >> 16 & 7;
        machInstCacheSize = 64 * (1<<is) * 2 * (1<<il) * (ia+1);
    }
    if (dl > 0) {
        unsigned ds = config1 >> 13 & 7;
        unsigned da = config1 >> 7 & 7;
        machDataCacheSize = 64 * (1<<ds) * 2 * (1<<dl) * (da+1);
    }
    if (machInstCacheSize > 0 || machDataCacheSize > 0) {
        printf ("cache: %u/%u kbytes\n",
            machInstCacheSize >> 10, machDataCacheSize >> 10);
    }
}

/*
 * cpu_startup: allocate memory for variable-sized tables,
 * initialize cpu, and do autoconfiguration.
 */
void
cpu_startup()
{
    register unsigned i;
    register caddr_t v;
    int base, residual;
    vm_offset_t minaddr, maxaddr;
    vm_size_t size;

    /*
     * Good {morning,afternoon,evening,night}.
     */
    printf(version);
    identify_cpu();
    printf("real mem = %d kbytes\n", ctob(physmem) >> 10);

    /*
     * Allocate virtual address space for file I/O buffers.
     * Note they are different than the array of headers, 'buf',
     * and usually occupy more virtual memory than physical.
     */
    size = MAXBSIZE * nbuf;
    buffer_map = kmem_suballoc(kernel_map, (vm_offset_t *)&buffers,
                   &maxaddr, size, TRUE);
    minaddr = (vm_offset_t)buffers;
    if (vm_map_find(buffer_map, vm_object_allocate(size), (vm_offset_t)0,
            &minaddr, size, FALSE) != KERN_SUCCESS)
        panic("startup: cannot allocate buffers");
    base = bufpages / nbuf;
    residual = bufpages % nbuf;
    for (i = 0; i < nbuf; i++) {
        vm_size_t curbufsize;
        vm_offset_t curbuf;

        /*
         * First <residual> buffers get (base+1) physical pages
         * allocated for them.  The rest get (base) physical pages.
         *
         * The rest of each buffer occupies virtual space,
         * but has no physical memory allocated for it.
         */
        curbuf = (vm_offset_t)buffers + i * MAXBSIZE;
        curbufsize = CLBYTES * (i < residual ? base+1 : base);
        vm_map_pageable(buffer_map, curbuf, curbuf+curbufsize, FALSE);
        vm_map_simplify(buffer_map, curbuf);
    }
    /*
     * Allocate a submap for exec arguments.  This map effectively
     * limits the number of processes exec'ing at any time.
     */
    exec_map = kmem_suballoc(kernel_map, &minaddr, &maxaddr,
                 16 * NCARGS, TRUE);
    /*
     * Allocate a submap for physio
     */
    phys_map = kmem_suballoc(kernel_map, &minaddr, &maxaddr,
                 VM_PHYS_SIZE, TRUE);

    /*
     * Finally, allocate mbuf pool.  Since mclrefcnt is an off-size
     * we use the more space efficient malloc in place of kmem_alloc.
     */
    mclrefcnt = (char *)malloc(NMBCLUSTERS+CLBYTES/MCLBYTES,
                   M_MBUF, M_NOWAIT);
    bzero(mclrefcnt, NMBCLUSTERS+CLBYTES/MCLBYTES);
    mb_map = kmem_suballoc(kernel_map, (vm_offset_t *)&mbutl, &maxaddr,
                   VM_MBUF_SIZE, FALSE);
    /*
     * Initialize callouts
     */
    callfree = callout;
    for (i = 1; i < ncallout; i++)
        callout[i-1].c_next = &callout[i];
    callout[i-1].c_next = NULL;

    printf("avail mem = %d kbytes\n", ptoa(cnt.v_free_count) >> 10);
    printf("using %d buffers containing %d bytes of memory\n",
        nbuf, bufpages * CLBYTES);
    /*
     * Set up CPU-specific registers, cache, etc.
     */
    initcpu();

    /*
     * Set up buffers, so they can be used to read disk labels.
     */
    bufinit();

    /*
     * Configure the system.
     */
    configure();
}

/*
 * machine dependent system variables.
 */
cpu_sysctl(name, namelen, oldp, oldlenp, newp, newlen, p)
    int *name;
    u_int namelen;
    void *oldp;
    size_t *oldlenp;
    void *newp;
    size_t newlen;
    struct proc *p;
{

    /* all sysctl names at this level are terminal */
    if (namelen != 1)
        return (ENOTDIR);               /* overloaded */

    switch (name[0]) {
    case CPU_CONSDEV:
        return (sysctl_rdstruct(oldp, oldlenp, newp, &cn_dev,
            sizeof cn_dev));
    default:
        return (EOPNOTSUPP);
    }
    /* NOTREACHED */
}

