sergev/LiteBSD/sys/mips/pic32/machdep.c
/*
 * Flush any TLB entries for the given address and TLB PID.
 */
void tlb_flush_addr(unsigned hi)
{
//printf("%s: %08x\n", __func__, hi);
    int x = mips_di();                  /* Disable interrupts */
    int pid = mfc0_EntryHi();           /* Save the current PID */
    int index;

    mtc0_EntryHi(hi);                   /* Look for addr & PID */
    asm volatile ("ehb");               /* Hazard barrier */
    asm volatile ("tlbp");              /* Probe for the entry */

    index = mfc0_Index();               /* See what we got */
    if (index >= 0) {
        /* Entry found - mark it as invalid.
         * Use invalid memory address, unique for every entry */
        mtc0_EntryHi(MACH_CACHED_MEMORY_ADDR ^ 0x3c000 ^ (index << 14));
        mtc0_EntryLo0(0);               /* Zero out low entry 0 */
        mtc0_EntryLo1(0);               /* Zero out low entry 1 */
        asm volatile ("ehb");           /* Hazard barrier */
        asm volatile ("tlbwi");         /* Write the TLB entry */
    }
    mtc0_EntryHi(pid);                  /* Restore the PID */
    mtc0_Status(x);                     /* Restore interrupts */
    asm volatile ("ehb");               /* Hazard barrier */
}

/*
 * Update the TLB entry if highreg is found; otherwise, enter the data.
 */
void tlb_update (unsigned hi, unsigned lo)
{
//printf("%s: hi=%08x, lo=%08x\n", __func__, hi, lo);
    int x = mips_di();                  /* Disable interrupts */
    int pid = mfc0_EntryHi();           /* Save the current PID */
    int index;

    mtc0_EntryHi(hi);                   /* Look for addr & PID */
    asm volatile ("ehb");               /* Hazard barrier */
    asm volatile ("tlbp");              /* Probe for the entry */
    index = mfc0_Index();               /* See what we got */

    if (hi & (1 << PGSHIFT)) {
        /* Odd page. */
        if (index >= 0) {
            /* Entry found - update EntryLo1. */
            asm volatile ("tlbr");      /* Read old entry */
            mtc0_EntryHi(hi);           /* Restore high reg */
            mtc0_EntryLo1(lo);          /* Setup low entry 1 */
            asm volatile ("ehb");       /* Hazard barrier */
            asm volatile ("tlbwi");     /* Write the TLB entry */
        } else {
            /* Not found - install new entry. */
            mtc0_EntryLo0(lo & PG_G);   /* Clear low entry 0 */
            mtc0_EntryLo1(lo);          /* Setup low entry 1 */
            asm volatile ("ehb");       /* Hazard barrier */
            asm volatile ("tlbwr");     /* Enter into a random slot */
        }
    } else {
        /* Even page. */
        if (index >= 0) {
            /* Entry found - update EntryLo0. */
            asm volatile ("tlbr");      /* Read old entry */
            mtc0_EntryHi(hi);           /* Restore high reg */
            mtc0_EntryLo0(lo);          /* Setup low entry 0 */
            asm volatile ("ehb");       /* Hazard barrier */
            asm volatile ("tlbwi");     /* Write the TLB entry */
        } else {
            /* Not found - install new entry. */
            mtc0_EntryLo0(lo);          /* Setup low entry 0 */
            mtc0_EntryLo1(lo & PG_G);   /* Clear low entry 1 */
            asm volatile ("ehb");       /* Hazard barrier */
            asm volatile ("tlbwr");     /* Enter into a random slot */
        }
    }
    mtc0_EntryHi(pid);                  /* Restore the PID */
    mtc0_Status(x);                     /* Restore interrupts */
    asm volatile ("ehb");               /* Hazard barrier */
}

/*
 * Flush instruction cache for range of addr to addr + len - 1.
 * The address can be any valid address so long as no TLB misses occur.
 */
void mips_flush_icache(vm_offset_t addr, vm_offset_t len)
{
    int x = mips_di();                  /* Disable interrupts */

    // TODO
    mtc0_Status(x);                     /* Restore interrupts */
    asm volatile ("ehb");               /* Hazard barrier */
}

/*
 * Flush data cache for range of addr to addr + len - 1.
 * The address can be any valid address so long as no TLB misses occur.
 * (Be sure to use cached K0SEG kernel addresses)
 */
void mips_flush_dcache(vm_offset_t addr, vm_offset_t len)
{
    int x = mips_di();                  /* Disable interrupts */

    // TODO
    mtc0_Status(x);                     /* Restore interrupts */
    asm volatile ("ehb");               /* Hazard barrier */
}
